<template><div><h1 id="web前端发展" tabindex="-1"><a class="header-anchor" href="#web前端发展" aria-hidden="true">#</a> WEB前端发展</h1>
<h2 id="web技术发展" tabindex="-1"><a class="header-anchor" href="#web技术发展" aria-hidden="true">#</a> WEB技术发展</h2>
<p>web是World Wide Web的简称，中文为全球局域网，也称万维网。web是一种基于超文本和http的、全球性的、动态交互的、跨平台的分布式图形欣喜系统。</p>
<p>Web设计初衷是一个静态信息资源发布媒介，通过超文本标记语言（HTML）描述信息资源，通过统一资源标识符（URI）定位信息资源，通过超文本转移协议（HTTP）请求信息资源。HTML、URL和HTTP三个规范构成了Web的核心体系结构，是支撑着Web运行的基石。</p>
<p>这样说太过专业化了，用简单的话说，打个比方：假设有100台计算机，这100台计算机可以分布在世界任何一个地方，无所谓。如果我想让这100台计算机相互通信，怎么办。那把这100台计算机用光纤相互连接起来吧，组成一个网路。</p>
<p>到这还不行，这只是硬件上连接起来了，通信是可以通信了，但计算机们都不知道对方发的消息是什么意思，而且寻址也是一个问题。这时就需要一个通信协议了，然后TCP/IP就诞生了。有了这个协议后，100台计算机算是真正可以发送消息了，而Web就是建立在这个基础上的。</p>
<p>再设想一下，现在1号计算机想获取99号计算机上磁盘上的一张图片，怎么办？这时URI就诞生了，URI作为统一资源标识符，专做这个事情。那么拿到资源后怎么展示就是HTML做的事情了，而计算机通信的协议就是通过HTTP协议了（HTTP协议是基于TCP协议的一个上层协议）。</p>
<p>因此，大家开发的Web应用本质上就是将服务器中的资源提供的互联网中，成为Web这个全球超大规模分布式系统中的一部分。下面我就来扒一扒Web开发经历过哪些阶段。</p>
<h2 id="世界上第一款计算机" tabindex="-1"><a class="header-anchor" href="#世界上第一款计算机" aria-hidden="true">#</a> 世界上第一款计算机</h2>
<p>背景：二战时期，美国军方为了计算炮弹弹道，让一些科学家造出了这世界上的第一台计算机“ENIAC”。</p>
<p>1946年2月14日，世界上第一台计算机“ENIAC”（埃尼阿克）在美国宾夕法尼亚大学诞生。这是一群科研人员共同努力的成果，但是起到最关键作用的是其数学家冯 · 诺依曼的设计思想，所以其被称为“现代计算机之父”
<img src="/1.jpg" alt="第一款计算机"></p>
<h2 id="互联网的前身" tabindex="-1"><a class="header-anchor" href="#互联网的前身" aria-hidden="true">#</a> 互联网的前身</h2>
<p>国际互联网,始于 1969年的美国,又称因特网,是全球性的网络,是一种公用信息的 载体, 是大众传媒的一种。 互联网是由一些使用公用语言互相通信的计算机连接而成的网络, 即广域网、 局域网及单机按照一定的通讯协议组成的国际计算机网络。 组成互联网的计算机 网络包括小规模的局域网(LAN 、城市规模的区域网(MAN 以及大规模的广域网(WAN 等 等。这些网络通过普通电话线、 高速率专用线路、 卫星、 微波和光缆等线路把不同国家的大 学、公司、科研部门以及军事和政府等组织的网络连接起来。</p>
<p>各行各业的人需要运用互联网来工作、生活、娱乐、消费,互联网本身是一个产业,同 时它也带动了其他所有的产业的发展。 计算机网络仅仅是传输信息的媒介, 是一个狭义的硬 件网。 而互联网是个广义的网, 它的精华则是它能够为你提供有价值的信息和令人满意的服 务。 互联网也是一个面向公众的社会性组织。 世界各地数以万计的人们可以利用互联网进行 信息交流和资源共享。 互联网是人类社会有史以来第一个世界性的图书馆和第一个全球性论 坛。 它为用户提供了高效工作环境, 入网的电脑终端可以调阅各种信息资料。 人民可以通过 互联网进行娱乐与消费,听歌、看视频、购物。随着通讯技术的发展,上网终端已经不限于 台式电脑和移动电脑,智能手机、平板电脑、掌上游戏机,甚至谷歌开发出来的眼镜、手表 都可以上网。网络无处不在,网络无所不能。</p>
<p>一、从互联网的发展历程来看,从最初的 ARPANET 到如今的万维网。</p>
<p>1、互联网的起源。这一时期推动互联网发展的推动力是美国的冷战思维。</p>
<p>作为对前苏联 1957年发射的第一颗人造地球卫星 Sputnik 的直接反应,以及由苏联的 卫星技术潜在的军事用途所导致的恐惧, 美国国防部组建了高级研究项目局 (ARPA 。 当时, 美国国防部为了保证美国本土防卫力量和海外防御武装在受到前苏联第一次核打击以后仍 然具有一定的生存和反击能力, 认为有必要设计出一种分散的指挥系统:它由一个个分散的 指挥点组成,当部分指挥点被摧毁后,其它点仍能正常工作, 并且这些点之间,能够绕过那 些已被摧毁的指挥点而继续保持联系。为了对这一构思进行验证, 1969 美国国防部委托开 发 ARPANET ,进行联网的研究。同年,美军在 ARPA 制定的协定下将美国加利福尼亚大学、 斯坦福大学研究学院加利福尼亚大学和犹他州大学的四台主要的计算机连接起来。 这个协定 由剑桥大学的 BBN 和 MA 执行,在 1969年 12月开始联机。它的目的就是重新树立美国在军 事科技应用开发方面的领导地位。当时的网络传输能力只有 50Kbps ,按标准来说就是非常 的低。</p>
<p>从 1970年开始, 加入 ARPANET 的节点数不断的增加。 当时 ARPANET 使用的是 NCP 协议, 它允许计算机相互交流,从 1970年开始,加入 ARPANET 的节点数不断的增加。最初的 NCP 协议下的 ARPANET 上连接了 15个节点共 23台主机。到 1972年时, ARPANET 网上的网点数 已经达到 40个,这 40个网点彼此之间可以发送小文本文件(当时称这种文件为电子邮件, 也就是我们现在的 E-mail 和利用文件传输协议发送大文本文件,包括数据文件(即现在 Internet 中的 FTP ,同时也发现了通过把一台电脑模拟成另一台远程电脑的一个终端而使 用远程电脑上的资源的方法, 这种方法被称为 Telnet 。 由此可看到, E-mail , FTP 和 Telnet 是 Internet 上较早出现的重要工具, 特别是 E-mail 仍然是目前 Internet 上最主要的应用。 但在 NCP 协议下,目的地之外的网络和计算机却不分配地址,从而限制了未来增长的机会。 但无论如何, ARPANET 成为了第一个简单的纯文字系统的 Internet 。可以说,最早促使互 联网最初起源的推动力是冷战时期的军备角力思维。</p>
<p>2、 TCP/IP协议的产生。</p>
<p>由于最初的通信协议下对于节点以及用户机数量的限制,建立一种能保证计算机之间 进行通信的标准规范(即“通信协议” 显得尤为重要。 1973年,美国国防部也开始研究如 何实现各种不同网络之间的互联问题。作为 Internet 的早期骨干网, ARPAnet 的试验并奠 定了 Internet 存在和发展的基础, ARPAnet 在技术上的另一个重大贡献是 TCP/IP协议簇的</p>
<p>开发和利用。 1972年 Robert Kahn来到 ARPA ,并提出了开放式网络框架,从而出现了大家 熟知的 TCP/IP(传输控制协议 /网际协议 。 1983年 1月 1日,所有连入 ARPANET 的主机实 现了从 NCP 向 TCP/IP协议的转换。为了将这些网络连接起来,美国人温顿瑟夫(Vinton Cerf 提出一个想法:在每个网络内部各自使用自己的通讯协议, 在和其它网络通信时使用 TCP/IP协议。</p>
<p>这个设想最终导致了 Internet 的诞生,并确立了 TCP/IP协议在网络互联方面不可动 摇的地位,基于 TCP/IP协议的公网的发展推动了互联网的发展。</p>
<p>3、网络的“春秋战国”时代。</p>
<p>70年代末到 80年代初,可以说是网络的春秋战国时代,各种各样的网络应运而生。 八十年代初, DARPANet 取得了巨大成功,但没有获得美国联邦机构合同的学校仍不能 使用。为解决这一问题,美国国家科学基金会(NSF 开始着手建立提供给各大学计算机系 使用的计算机科学网(CSNet 。 CSNet 是在其他基础网络之上加统一的协议层,形成逻辑上 的网络,它使用其他网络提供的通信能力,在用户观点下也是一个独立的网络。 CSNet 采用 集中控制方式,所有信息交换都经过 CSNet-Relay (一台中继计算机进行。</p>
<p>1982年,美国北卡罗莱纳州立大学的斯蒂文贝拉文(Steve Bellovin 创立了著名的 集电极通信网络——网络新闻组 (Usenet , 它允许该网络中任何用户把信息 (消息或文章 发送给网上的其他用户,大家可以在网络上就自己所关心的问题和其他人进行讨论; 1983年在纽约城市大学也出现了一个以讨论问题为目的的网络—— BITNet , 在这个网络中, 不同 的话题被分为不同的组, 用户可以根据自己的需求, 通过电脑订阅, 这个网络后来被称之为 Mailing List (电子邮件群 ; 1983年,在美国旧金山还诞生了另一个网络 FidoNet (费多 网或 Fido BBS即公告牌系统。它的优点在于用户只要有一部电脑、一个调制解调器和一 根电话线就可以互相发送电子邮件并讨论问题,这就是后来的 Internet BBS。</p>
<p>以上这些网络都相继并入 Internet 而成为它的一个组成部分, 具有特定用途和特点的 网络的发展,推动了 Internet 成为全世界各种网络的大集合。</p>
<p>4、 Internet 的基础—— NSFNET</p>
<p>Internet 的第一次快速发展源于美国国家科学基金会(National Science Foundation 简称 NSF 的介入,即建立 NSFNET 。</p>
<p>1983年, ARPAnet 分裂为两部分, ARPAnet 和纯军事用的 MILNET 。八十年代初,美国 一大批科学家呼吁实现全美的计算机和网络资源共享, 以改进教育和科研领域的基础设施建 设,抵御欧洲和日本先进教育和科技进步的挑战和竞争。</p>
<p>80年代中期,美国国家科学基金会(NSF 为鼓励大学和研究机构共享他们非常昂贵的 四台计算机主机,希望各大学、研究所的计算机与这四台巨型计算机联接起来。最初 NSF 曾试图使用 DARPANet 作 NSFNET 的通信干线,但由于 DARPANet 的军用性质,并且受控于政 府机构,这个决策没有成功。于是他们决定自己出资,利用 ARPANET 发展出来的 TCP/IP通 讯协议,建立名为 NSFNET 的广域网。</p>
<p>Internet 在 80年代的扩张不单带来量的改变, 同时亦带来某些质的变化。 由于多种学术 团体、企业研究机构,甚至个人用户的进入, Internet 的使用者不再限于纯计算机专业人员。 新的使用者发觉计算机相互间的通讯对他们来讲更有吸引力。于是,他们逐步把 Internet 当 作一种交流与通信的工具,而不仅仅只是共享 NSF 巨型计算机的运算能力。 NSFnet 对 Internet 的最大贡献是使 Internet 向全社会开放, 而不象以前的那样仅供计算机研究人员和 政府机构使用。更多的非计算机专业人员希望通过使用广域网得到他们希望得到的信息。 5、中国互联网的发展。</p>
<p>1987年 9月 20日,钱天白教授发出我国第一封电子邮件“越过长城,通向世界” ,揭 开了中国人使用 Internet 的序幕。 1990年 10月,钱天白教授代表中国正式在国际互联网</p>
<p>络信息中心的前身 DDN-NIC (相当于现在的 INTERNIC 注册登记了我国的顶级域名 CN ,并 且从此开通了使用中国顶级域名 CN 的国际电子邮件服务,因特网在我国进入了飞速发展时 期。 1996年 1月, ChinaNET 全国骨干网建成并正式开通,全国范围的公用计算机互联网络 开始提供服务。</p>
<p>截至 2010年 6月,中国网民规模达到 4.2亿,大部分网络应用在网民中更加普及,各 类网络应用的用户规模持续扩大。其中, 商务类应用表现尤其突出,网上支付、网络购物和 网上银行半年用户增长率均在 30%左右,远远超过其他类网络应用。社交网站、网络文学和 搜索引擎用户增长也较快。 截至 2010年 6月, 网络购物、 网上支付和网上银行的使用率分 别为 33.8%、 30.5%和 29.1%,增速在各类应用中排名前三。网络购物在主要网络应用中排 名提升一位,使用率超过了论坛。从 2010开始互联网彻底走进人们的生活。通讯电子产品 价格的急剧下降,导致笔记本,台式电脑,智能手机的广泛普及使得上网变得更加简单。 二、从技术的角度来看,从包交换、通信协议以及组网的规模一直都是科学家和通信 工作者们研究与努力的方向。这些技术层面的不断突破,促进了互联网的发展。</p>
<p>1、利用 TCP/IP协议代替 NCP 协议。</p>
<p>最初 BBN 公司设计、组装并运行了 ARPANET 。 1969年就有了一个充分发展了的包交 换网络。 BBN 建造了一个多处理器的系统一 Pluribus , 许多软件开发后来又被用在 ARPANET 上。那时, TCP /IP 还在早期阶段, IETF 的科学家所做的是将 TCP /IP 引入 TIP ,而 TIP 又是 IMP 的一部分。项目中的一个步骤就是用 TCP /IP 协议代替 ARPANET 原来的主机到 主机的协议 NCP 。</p>
<p>2、用多层的路由分配来解决路由表限制的问题。</p>
<p>起初要建造一些被称作网关的东西 (现在叫做路由 。当时能够意识到路由器本身就可以 作为分组交换机,这是一个很激进的想法, BBN 里大行其道的还是 ARPANET 风格的分组 交换, 而这在商业上追根溯源是来自 X . 25包交换。 BBN 的工作人员们认为 IP 和路由并不 可靠。 科学家们花费了很大力气才说服他们这是一个重要的商机。 此后, 科学小组研发并部 署了四代网关/路由器、 Hw 、 SW 等等。有很多问题至今还在讨论中,比如路由表变得太 大。然后有了试图区分内部路由和外部路由的想法。早先有一个协议,然后取而代之的是 BGP(边界网关协议 。为了完成这项工作, BBN 定期举行会议—开始是为了 ARPA ,后来是 为了防御数据网 (DefenseDatanetwork。这一切都在 IETF 之前,作为一项规范化制定协议的 活动,后来才发展成为了 IETF 。</p>
<p>3、随着 IETF 的设立与发展壮大,下一代的 IP 协议:IPV6的诞生。</p>
<p>IETF ,互联网工程任务组,成立于 1985年底,是全球互联网最具权威的技术标准化组 织, 主要任务是负责互联网相关技术规范的研发和制定, 当前绝大多数国际互联网技术标准 出自 IETF 。随着 IETF 的发展壮大,第二任主席 PhilGross 决定按不同领域划分 IETF 。由于 在 BBN 时路由方面的工作, Bob Hinton受任为第一任路由区域主管 (AreaDirector, 简称 AD 。 IETF 建立并统一了现存的所有路由协议:RIPv2、 OsPF 、 IS — IS 、 BGP 。引人注目的是,那 时建立的一些工作组至今还在继续工作。 Bob 的小组参与了 IPng 过程的工作,和另一个组 合作 (和 SteveDeering 起 ,研发了下一个版本的 IP —— IPv6。</p>
<p>互联网之所以能有今天的发展,有两个因素功不可没:</p>
<p>一是 IP 和 TCP 简单易用的接口,二是设备之间无需有十分紧密的联系。 这样一来, 不同的公司、组织、 不同的人都可以参与建设互联网。要想建立不仅技术上可行、 同时商业 环境上友好的网络, 这是唯一的途径:各自为政, 没有人独揽大权。联系过于紧密的事物是 难以测度的。 一个相反的例子就是电话网络最初的发展。 在美国和许多其他国家, 都有一个 组织包揽建网、 设立标准、技术研发的全部工作。 互联网从未按照这种模式发展。 从一开始 大家就各自为政,十分灵活。这是互联网之所以成长壮大并如此多样的原因之一。</p>
<p>未来的互联网仅仅靠现有的笔记本电脑、 PC 和服务器是不够的,越来越多的小型器件 和植入型的器件将会出现。这些设备可能是自组的,但它们相互联网。 建造如此庞大、 复杂 并且密集的网络, 一切都要达到互联, 并且在一个安全的方式下实现交互, 这就是我们通常 所说的物联网。这些都还需要我们长时间的努力。</p>
<h2 id="web发展几个阶段" tabindex="-1"><a class="header-anchor" href="#web发展几个阶段" aria-hidden="true">#</a> WEB发展几个阶段</h2>
<h3 id="静态网页时代" tabindex="-1"><a class="header-anchor" href="#静态网页时代" aria-hidden="true">#</a> 静态网页时代</h3>
<p>1994年，网景公司（Netscape）发布了Navigator浏览器0.9版。这是历史上第一个比较成熟的网络浏览器，轰动一时。但是，这个版本的浏览器只能用来浏览，不具备与访问者互动的能力。最初在浏览器中主要展现的是静态文本或图像信息，即将网页的HTML代码编写好，然后将他放在服务器上通过浏览器访问这个静态的HTML文件。</p>
<p>这个时期的技术处于较为原始阶段，没有Javascript，没有CSS的年代，写出的HTML给人的感觉就是一些文字堆砌在一起，没有美感，也不存在动态交互。只有GIF图片第一次为HTML页面引入了动态元素。那时的网页大致长这个样子</p>
<p><img src="/2.png" alt=""></p>
<p>此时的网景公司（Netscape）也苦于浏览器没有动态效果，因此急需一种脚本语言，后来网景公司开发出了一门新语言javascript，有了Javascript后用户就具备了与浏览器交互的能力。但是页面的画风太丑，一直被人们吐槽，因此大概在同时期又诞生了另一名语言CSS，专门负责定义HTML的标签样式。</p>
<p>1994年，W3C组织（World WideWeb Consortium）成立，CSS的创作成员全部成为了W3C的工作小组并且全力以赴负责研发CSS标准，层叠样式表的开发终于走上正轨，有越来越多的成员参与其中。Javascript与CSS两大前端语言诞生后，静态页面也可以像桌面应用程序那样美观和动态交互了，下面是苹果公司早期的主页</p>
<p><img src="/3.png" alt=""></p>
<p>那时Web的工作原理也相对简单，就是浏览器请求服务器的静态HTML文件，然后服务器将静态文件返回给浏览器渲染成文本展示</p>
<h3 id="动态内容cgi时代" tabindex="-1"><a class="header-anchor" href="#动态内容cgi时代" aria-hidden="true">#</a> 动态内容CGI时代</h3>
<p>随着业务发展，人们已经不仅仅满足于访问放在Web服务器上的静态文件，比如你想让访问者看到有多少其他访问者访问了这个网站，或者想让客户去填写这样一个表单，包含有姓名和邮件地址，要实现这样的功能，意味着客户端与服务端要进行数据交互，而且服务端还需要把用户数据永久的保存起来，这些功能是静态页面无法实现的。</p>
<p>于是1993年CGI（Common Gateway Interface）出现了，Web上的动态信息服务开始蓬勃兴起。CGI定义了Web服务器与外部应用程序之间的通信接口标准，因此Web服务器可以通过CGI执行外部程序，让外部程序根据Web请求内容生成动态的内容。</p>
<p>Perl因为跨操作系统和易于修改的特性成为CGI的主要编写语言。当然，CGI可以用任何支持标准输入输出和环境变量的语言编写，比如Shell脚本，C/C++语言，只要符合接口标准即可。</p>
<p>比如用C语言编写CGI程序，把希望返回的HTML内容通过printf输出就可以发送给Web服务器，进而返回给用户。CGI应用程序运行在浏览器可以请求的服务器系统上
由于CGI执行时需要使用服务器CPU时间和内存。如果有成千上万的这种程序同时运行，会对服务器系统提出极高的要求。你要慎重考虑这个问题，以防止服务器系统崩溃。当时组织CGI/Perl这样的脚本代码太混乱了。</p>
<p>CGI伸缩性不是太好(经常是为每个请求分配一个新的进程)，也不太安全(直接使用文件系统或者环境变量)，同时也没提供一种结构化的方式去构造动态应用程序。如果一个CGI脚本可以在每台计算机上做同样的事情；编写脚本就会变的很容易。</p>
<p>不幸的是，CGI脚本依赖于服务器的操作系统，因此，对于非UNIX服务器来说，Prl（UNIX下编写脚本的一个常用工具）脚本毫无用处。这也是开发人员最痛苦的事情，这意味着同一个应用服务，需要根据不同的操作系统各自开发一套。所以，你必须定制安装你的CGI脚本。这也是后来基于 JVM 平台的语言流行的主要因素。</p>
<h3 id="模板引擎时代" tabindex="-1"><a class="header-anchor" href="#模板引擎时代" aria-hidden="true">#</a> 模板引擎时代</h3>
<h4 id="php-asp时代" tabindex="-1"><a class="header-anchor" href="#php-asp时代" aria-hidden="true">#</a> PHP/ASP时代</h4>
<p>尽管CGI解决了网页动态数据的问题，但它的弊端也是越来越明显，依赖于操作系统，移植性差，HTML代码与服务端代码杂糅在一起不便于维护。为了处理更复杂的应用，人们在想能不能把HTML返回中固定的部分存起来（我们称之为模版），把动态的部分标记出来， Web请求处理的时候，程序先获取动态数据，再把模版读入进来，把动态数据填充进去，形成最终返回。</p>
<p>举个例子，你通过页面搜索框搜索一个关键词，请求到达Web服务器，后台从数据库或是文件里拿到数据，然后把这些数据填充到返回结果的HTML模版中，返回给浏览器。</p>
<p>但是这件事情自己来做显然太繁琐而且是重复劳动，于是1994年的时候，PHP诞生了，PHP可以把程序（动态内容）嵌入到HTML（模版）中去执行，不仅能更好的组织Web应用的内容，而且执行效率比CGI还更高。</p>
<p>之后96年出现的ASP上也都可以看成是一种支持某种脚本语言编程，ASP使用VB语言的模版引擎。更重要的是，模板引擎的出现使得HTML代码和服务端代码分离开来，使得开发流程更加规范，逻辑更加清晰。而CSS允许开发者用外联的样式表来取代难以维护的内嵌样式，而不需要逐个去修改HTML元素，这让HTML页面更加容易创建和维护。</p>
<p>此时，有了这些脚本语言，搭配上后端的数据库技术，Web更是开始大杀四方了，像电子商务这样的应用系统也可以通过Web技术来构建。Web已经从一个静态资源分享媒介真正变为了一个分布式的计算平台了。</p>
<p>反过来看，你也应该知道，不是只有当今这些流行脚本语言可以写Web应用，C语言一样可以做这件事情。通过C语言来获取数据和渲染Web页面的例子在追求极致访问速度的互联网公司是非常常见的，但是脚本语言在开发效率上更胜一筹。</p>
<h4 id="jsp-servlet时代" tabindex="-1"><a class="header-anchor" href="#jsp-servlet时代" aria-hidden="true">#</a> JSP/SERVLET时代</h4>
<p>Servlet是一个优秀的Web技术规范，Servlet 看起来像是通常的 Java 程序。Servlet 导入特定的属于 Java Servlet API 的包。因为是对象字节码，可动态地从网络加载，可以说 Servlet 对 Server 就如同 Applet对 Client 一样，但是，由于 Servlet 运行于 Server 中，它们并不需要一个图形用户界面。从这个角度讲，Servlet 也被称为 FacelessObject。</p>
<p>由于前后端交互的问题，sun公司又发布了JSP，JSP全称是Java Server Pages，它和Servlet技术一样，都是sun公司定义的一种用于开发动态web资源的技术。JSP最大的特点在于，写jsp就像在写html，但它相比html而言，html只能为用户提供静态数据，而Jsp技术允许在页面中嵌套java代码，为用户提供动态数据。它的出现一改以前java开发人员需要在Servlet中自己将html代码 out.write 返回给前端的工作方式，而是直接在jsp中编写html代码，极大的方便了开发人员的使用。这时已经初见前端分离的雏形了。</p>
<p>jsp出现后，美工可以把页面原型图画好，再交给前端工程师按照原型图将静态页面写出来，待静态页面写好后，再交给java开发工程师把html代码复制到jsp中，这时只需要把后端处理的值填到对应的jsp中即可。对于一个系统开发，人员可以明确分工，前端后端开发部分可以同时进行。</p>
<h2 id="web的css-javascript" tabindex="-1"><a class="header-anchor" href="#web的css-javascript" aria-hidden="true">#</a> WEB的CSS/JavaScript</h2>
<p>随着后端技术的发展前端技术也在日新月异，如今前端网页开发与莽荒时代的静态网页相比，不仅有各种各样的UI框架，更是参考了后端技术，在前端也实现MVC的架构。下面就来看一看前端技术的演变。</p>
<p>首先就是CSS和JS的诞生。javacript的诞生还有一段故事，前面说到网景公司开发的浏览器只能展示静态页面，因此网景公司想在浏览器端嵌入一种语言或是脚本，使得用户可以和浏览器做一些动态交互，从而提升用户的体验。</p>
<p>当时网景公司有两个方案：一个是采用现有的语言，如Perl、Python、Tcl、Scheme等等，允许它们直接嵌入网页；另一个是发明一种全新的语言。高层对于两个方案一时难以决定，就在这时，发生了另外一件大事：1995年Sun公司将Oak语言改名为Java，正式向市场推出。</p>
<p>Sun公司大肆宣传，许诺这种语言可以”一次编写，到处运行”，它看上去很可能成为未来的主宰。网景公司动了心，决定与Sun公司结成联盟。它不仅允许Java程序以applet（小程序）的形式，直接在浏览器中运行；甚至还考虑直接将Java作为脚本语言嵌入网页，只是因为这样会使HTML网页过于复杂，后来才不得不放弃。</p>
<p>此时，34岁的系统程序员Brendan Eich登场了。1995年4月，网景公司录用了他。公司决定指派他作为新语言的开发者，并要求这个语言必须与java足够相似，但比java简单。但是，他对Java一点兴趣也没有。</p>
<p>为了应付公司安排的任务，他只用10天时间就把Javascript设计出来了。（ps：与大神的差距，别人10天开发出一门语言，我10天能完全上手一门新技术就不错了:）由于设计时间太短，语言的一些细节考虑得不够严谨，导致后来很长一段时间，Javascript写出来的程序混乱不堪。谁也想不到如今世界排名前5五的Javascript竟是在10天内被开发出来的。</p>
<p>随着HTML的成长，为了满足页面设计者的要求，HTML添加了很多显示功能。但是随着这些功能的增加，HTML变的越来越杂乱，而且HTML页面也越来越臃肿。于是CSS便诞生了。1994年哈坤·利提出了CSS的最初建议。而当时伯特·波斯正在设计一个名为Argo的浏览器，于是他们决定一起设计CSS。其实当时在互联网界已经有过一些统一样式表语言的建议了，但CSS是第一个含有“层叠”丰意的样式表语言。</p>
<p>层叠样式表(英文全称：Cascading Style Sheets)是一种用来表现HTML（标准通用标记语言的一个应用）或XML（标准通用标记语言的一个子集）等文件样式的计算机语言。CSS不仅可以静态地修饰网页，还可以配合各种脚本语言动态地对网页各元素进行格式化。CSS 能够对网页中元素位置的排版进行像素级精确控制，支持几乎所有的字体字号样式，拥有对网页对象和模型样式编辑的能力。</p>
<h2 id="ajax" tabindex="-1"><a class="header-anchor" href="#ajax" aria-hidden="true">#</a> AJAX</h2>
<p>avaScript最终被提交到欧洲计算机制造商协会(ECMA)，做为中立的ECMA开始了标准化脚本语言之路，并将其命名为ECMAScript。JavaScript可以响应浏览器端的用户事件，检测表单的正确性，动态修改DOM结构，因此可以减少与服务器端的通信开销，并且做出很酷的页面动态效果。2005年出现的AJAX这个概念使得JavaScript再次大放异彩。AJAX即“Asynchronous Javascript And XML”（异步的JavaScript和XML技术）。</p>
<p>Ajax 不是一种新的编程语言，而是一种用于创建更好更快以及交互性更强的Web应用程序的技术。AJAX是一种已有技术的mashup，多种技术组合在一起形成了其特色和优势，早在1998年就已经开始有人使用。</p>
<p>Google在地图和Gmail等产品中对这项技术的深入应用，以及AJAX这个吸引眼球的名字的提出，使其正式站在了聚光灯下，开始吸引无数人的目光。我们知道Web应用中用户提交表单时就向Web服务器发送一个请求，服务器接收并处理传来的表单，并返回一个新的网页。</p>
<p>而前后两个页面中的往往大部分HTML代码是一样的，每次都返回整个页面内容是一种带宽资源的浪费。而AJAX应用仅向服务器发送并取回必须的数据，并在客户端采用JavaScript处理来自服务器响应，更新页面的局部信息。使用Ajax的最大优点，就是能在不更新整个页面的前提下维护数据。这使得Web应用程序更为迅捷地回应用户动作，并避免了在网络上发送那些没有改变的信息。</p>
<p>对应用Ajax最主要的批评就是，它可能破坏浏览器的后退与加入收藏书签功能。在动态更新页面的情况下，用户无法回到前一个页面状态，这是因为浏览器仅能记下历史记录中的静态页面。</p>
<p>一个被完整读入的页面与一个已经被动态修改过的页面之间的可能差别非常微妙；用户通常都希望单击后退按钮，就能够取消他们的前一次操作，但是在Ajax应用程序中，却无法这样做。</p>
<p>不过开发者已想出了种种办法来解决这个问题。AJAX的出现，催生诸如EXTJS、EASYUI等一些基于JS的前端框架。大大提高了前端页面的开发效率。</p>
<h2 id="前端框架-vue-react-angular" tabindex="-1"><a class="header-anchor" href="#前端框架-vue-react-angular" aria-hidden="true">#</a> 前端框架 VUE/React/Angular</h2>
<p><img src="/4.webp" alt=""></p>
<p>在MV模式下前端又有了自己的模式,MVVM的模式这种模式下，前后端的分工非常清晰，前后端的关键协作点是 Ajax 接口，规定好交互接口后，前后端工程师就可以根据约定，分头开工，开发环境中通过Mock等方式进行测试，同时在特定时间节点进行前后端集成测试。</p>
<p>但是，随着业务功能的愈发复杂，这种模式本质上和JSP时代的Web开发并无本质区别，只不过是将复杂的业务逻辑从JSP文件转移到了JavaScript文件中而已。现在，对于一个前端功能、交互复杂的业务，大量的逻辑处理使得javascript的代码量激增。很自然地，像服务端从JSP向MVC框架转换的过程一样，前端开发也出现了大量的MVC框架。</p>
<p>通过MVC框架又衍生出了许多其它的架构，统称MV* ，最常见的是MVP与MVVM。总的来说，MV* 框架的提出是为了解决前端开发的复杂度，提供一套规则组织代码、分层，通过合理的组织和分层，前端的代码职责明确、清晰，便于开发与测试。目前比较优秀的前端MVC框架就是Angular.js，Vue.js和React.js。被尊为前端三大框架</p>
</div></template>
