<template><div><h1 id="html发展史" tabindex="-1"><a class="header-anchor" href="#html发展史" aria-hidden="true">#</a> HTML发展史</h1>
<h2 id="蒂姆伯纳斯李" tabindex="-1"><a class="header-anchor" href="#蒂姆伯纳斯李" aria-hidden="true">#</a> 蒂姆伯纳斯李</h2>
<p><img src="/3.jpg" alt=""></p>
<p><code v-pre>互联网之父蒂姆·伯纳斯- 李</code></p>
<p>蒂姆·伯纳斯-李这个名字对普通人来说显得有些陌生，不过，在IT圈内却是耳熟能详。如果20年前，他能为自己的发明申请专利，别说他的名字会人人皆知，就连世界首富的头衔恐怕也非他莫属。然而，这位互联网的创始人却始终坚持普通人优先受益的“浪漫主义”情怀，他最大的愿望就是让互联网保持开放和自由。近日，蒂姆在出席一个全球IT会议时说，目前全球约有1/5的人拥有网络，而他的心愿是能让所有使用者都能免费上网，享受他的发明带来的好处。</p>
<h2 id="生平简介" tabindex="-1"><a class="header-anchor" href="#生平简介" aria-hidden="true">#</a> 生平简介</h2>
<p>蒂姆·伯纳斯·李 [1]  （Tim Berners-Lee），OM，KBE，FRS，FREng，FRSA，（Sir Timothy John &quot;Tim&quot; Berners-Lee，1955年6月8日－），英国计算机科学家。
他是万维网的发明者，南安普顿大学与麻省理工学院教授。1990年12月25日，罗伯特·卡里奥在CERN和他一起成功通过Internet实现了HTTP代理与服务器的第一次通讯。
万维网联盟（W3C）是伯纳斯·李为关注万维网发展而创办的组织，并担任万维网联盟的主席。他也是万维网基金会的创办人。伯纳斯-李还是麻省理工学院计算机科学及人工智能实验室创办主席及高级研究员。同时，伯纳斯-李是网页科学研究倡议会的总监。最后，他是麻省理工学院集体智能中心咨询委员会成员。
2004年，英女皇伊丽莎白二世向伯纳斯·李颁发不列颠帝国勋章的爵级司令勋章。2009年4月，他获选为美国国家科学院外籍院士。在2012年夏季奥林匹克运动会开幕典礼上，他获得了“万维网发明者”的美誉。伯纳斯·李本人也参与了开幕典礼，在一台NeXT计算机前工作。他在Twitter上发表消息说：“这是给所有人的”，体育馆内的LCD光管随即显示出文字来。2017年，他因“发明万维网、第一个浏览器和使万维网得以扩展的基本协议和算法”而获得2016年度的图灵奖。</p>
<p>蒂姆进入大学，1976年从牛津大学物理系获得一级荣誉学位，毕业之后，曾经供职于英国一些高技术公司，从事集成电路和系统设计研究，其出众的才华逐渐得以展露。1984年，一个偶然的机会，蒂姆来到瑞士的日内瓦，进入著名的由欧洲原子核研究会（CERN）建立的粒子实验室。该实验室的首席研究员是华裔物理学家、诺贝尔奖获得者——丁肇中。
在这里年轻的蒂姆接受了一项极富挑战性的工作：为了使欧洲各国的核物理学家能通过计算机网络及时沟通传递信息进行合作研究，委托他开发一个软件，以便使分布在各国各地物理实验室、研究所的最新信息、数据、图像资料可供大家共享。软件开发虽非蒂姆的本行，但强有力的诱惑促使他勇敢地接受了这个任务。
早在牛津大学主修物理时蒂姆就不断地思索，是否可以找到一个&quot;点&quot;，就好比人脑，能够透过神经传递、自主作出反应。经过艰苦的努力，他编制成功了第一个高效局部存取浏览器&quot;Enquire&quot;，并把它应用于数据共享浏览等，取得了成功。
初战胜利大大激发了蒂姆的创造的热情，小范围的计算机联网实现信息共享已不再是目标，蒂姆把目标瞄向了建立一个全球范围的信息网上，以彻底打破信息存取的壁垒。1989年3 月，蒂姆向CERN递交了一份立项建议书，建议采用超文本技术（Hypertext）把CERN内部的各个实验室连接起来，在系统建成后，将可能扩展到全世界。这个激动人心的建议在CERN引起轩然大波，但这里终究是核物理实验室而非计算机网络研究中心，虽有人支持但最后仍没有被通过。蒂姆并没有灰心，他花了2个月重新修改了建议书，加入了对超文本开发步骤与应用前景的阐述，用词恳切，并再一次呈递上去；这回终于得到了上司的批准。于是蒂姆得到了一笔经费，购买了一台NEXT计算机，并率领助手开发试验系统。
1980年代后期超文本技术已经出现，当时还有国际间的超文本学术会议，每次都有上百篇的有关超文本的论文问世，但没有人能想到把超文本技术应用到计算机网络上来：超文本只是一种新型的文本而已。机遇偏爱有准备的人。有一次蒂姆端着一杯咖啡，走在实验室走廊上经过怒放的紫丁香花丛，盛夏幽雅的花香伴随着醇香的咖啡味飘入实验室，霎那间里蒂姆脑中灵感迸发：人脑可以透过互相联贯的神经传递信息（咖啡香和紫丁香），为什么不可以经由电脑文件互相连接形成&quot;超文本&quot;呢？
服务器诞生</p>
<p>说干就干，1989年仲夏之夜，蒂姆成功开发出世界上第一个Web服务器和第一个Web客户机。虽然这个Web服务器简陋得只能说是CERN的电话号码簿，它只是允许用户进入主机以查询每个研究人员的电话号码，但它实实在在是一个所见即所得的超文本浏览/编辑器。</p>
<p>1989年12月，蒂姆为他的发明正式定名为World Wide Web，即我们熟悉的WWW；1991年5月WWW在 Internet上首次露面，立即引起轰动，获得了极大的成功被广泛推广应用。</p>
<p>国际互联网Internet 在1960年代就诞生了，为什么没有迅速流传开来呢？其实，很重要的原因是因为联接到Internet需要经过一系列复杂的操作，网络的权限也很分明，而且网上内容的表现形式极端单调枯燥。</p>
<p>Web通过一种超文本方式，把网络上不同计算机内的信息有机地结合在一起，并且可以通过超文本传输协议（HTTP）从一台Web服务器转到另一台Web服务器上检索信 息。Web服务器能发布图文并茂的信息，甚至在软件支持的情况下还可以发布音频和视频信息。此外，Internet的许多其它功 能，如E-mail、 Telnet、 FTP、 WAIS 等都有可通过Web实现。</p>
<p>美国著名的信息专家《数字化生存》的作者尼葛洛庞帝教授认 为：1989年是Internet历史上划时代的分水岭。的确WWW技术给Internet赋予了强大的生命力，Web浏览的方式给了互联网靓丽的青春。</p>
<p>在今天作为Web之父的蒂姆·贝纳斯·李已经功成名就。但并不象大多数普通人都认为的那样，和其它科学发明一样，环球网（WWW）的建立是通向致富的捷径。与那些依托互联网一夜暴富之士相比，蒂姆仍然坚守在学术研究岗位上，那种视富贵如浮云的胸襟，真正表现了一个献身科学的学者风度。
是不是蒂姆没有看到WWW的价值呢？不是的。其实早在1992年，也就是著名的网景公司的马克·安德森发明的浏览器尚未问市之前，蒂姆和他的研究伙伴曾向欧洲权威的律师咨询，考虑开放&quot;网软&quot;公司（Websoft）销售网络浏览器软件，但他最后放弃了这个决定。因为蒂姆当时预见到一旦他的浏览/编辑器问世，势必引起网络软件大战，使国际互联网陷入割据分裂，为了他所钟爱的WWW事业，他决定在WWW的百家争鸣中扮演一个技术直辖市的角色，而不是角逐财富的商人。</p>
<p>90年代以来国际互联网的发展正如蒂姆所预见的，网景与微软的浏览器之争，被称为万维网第一商战，快速膨胀的网络已有瘫痪之虞。为此在1994年，蒂姆创建了非赢利性的万维网联盟W3C（World Wide Web Consortium），邀集Microsoft、 Netscape、 Sun、Apple、IBM 等共155家互联网上的著名公司，致力达到WWW技术标准化的协议，并进一步推动Web技术的发展。蒂姆坚持，W3C最基本的任务是维护互联网的对等性，让它保有最起码的秩序。</p>
<p>他反复重申建构Web技术的初衷是藉由WWW作为创意和效率的工具，提供使用者更好的共事与资讯获取交流环境，但当前WWW的增长象&quot;缓慢地深层爆炸&quot;般的（蒂姆语）进军商业领域，欲局限人际关系沟通的后果是作为创始者始料未及和十分遗憾的一点。总部设在美国麻省理工（MIT）的W3C现已有40余名工作人员，分工为若干研究开发小组，任务就是力图引导网络革命的发展方向，蒂姆风趣地把它称之为一项&quot;如驾驶着大雪橇从山顶上以加速度向下滑的惊险工作&quot;。</p>
<p>当1996年底美国《研究和发展杂志》授予蒂姆Scientist of the Year(年度科学家)称号时，蒂姆·伯纳斯·李认为WWW开启信息时代新纪元，不过是&quot;偶然的因缘&quot;&quot;水到渠成而已&quot;。他也不后悔没有自组网络软件公司，这对他来说，只是&quot;取与舍&quot;，并非&quot;得与失&quot;。回顾过去，蒂姆----这位满怀浪漫理想主义的科学家，以谦和的语气说：&quot;Web倒是可以给梦想者一个启示--你能够拥有梦想，而且梦想能够实现。&quot;的确，Web是蒂姆在紫丁香和实验室之间的梦想，而伟大的国际互联网正是由无数像蒂姆·伯纳斯·李这样的先驱们的无私耕耘下成长起来的。</p>
<h2 id="网络大事件" tabindex="-1"><a class="header-anchor" href="#网络大事件" aria-hidden="true">#</a> 网络大事件</h2>
<p>1955年6月8日，蒂姆出生于英格兰伦敦西南部，由于父母都参与了世界上第一台商业电脑——曼切斯特1型（Manchester Mark I）的建造，所以蒂姆从小就对计算机产生了浓厚的兴趣。</p>
<p>在牛津大学女王学院读书期间，他就用从旧货商店花7美元淘来的电视机、M6800处理器、烙铁、电路板组装出了自己的第一台电脑。</p>
<p>1976年，在取得物理学士学位并顺利毕业之后，蒂姆先后在英国的一些高技术公司就职，从事集成电路和系统设计研究等相关工作，并逐渐展露出了其不菲的才华。</p>
<p>1984年，在一个偶然的机会之下，蒂姆来到瑞士的日内瓦，进入著名的由欧洲原子核研究会（CERN）建立的粒子实验室。</p>
<p>该实验室的首席研究员是华裔物理学家、诺贝尔奖获得者——丁肇中。</p>
<p>当时，欧洲拥有大大小小共几十家物理实验室，彼此之间的信息的传送大多通过电报或者邮寄，效率十分低下。</p>
<p>于是，为了增加效率，蒂姆被委托开发一款软件，可以让欧洲各国的核物理学家能通过计算机网络及时沟通传递信息进行合作研究，以便彼此之间共同分享最新的信息、数据、及图像资料。</p>
<p>软件开发虽非蒂姆的本行，但天生喜欢挑战的性格，却促使他勇敢地接受了这个任务。</p>
<p>在经过艰苦的努力之后，他成功了编制了一款，也是世界上第一款高效局部存取浏览器——Enquire，并把它应用于数据共享浏览中。</p>
<p>初次尝试就获得成功，这让蒂姆信心大增，于是他冒出了一个大胆的想法：</p>
<p>信息的分享不再局限于实验室之间，而是推向全世界。建立一个全球范围的信息网，以彻底打破信息存取的壁垒。</p>
<p>这个想法在当时简直是惊世骇俗，即便是在由许多意识超前的科学家组成的CERN中，也掀起了一场轩然大波。</p>
<p>所有人都被蒂姆这疯狂的想法所震惊，并对此表现出了极大的兴趣。</p>
<p>1989年，蒂姆正式向CERN提交了申请。</p>
<p>遗憾的是，CERN只是物理实验室而已，并非计算机网络研究中心，所以他的申请并没有被通过。</p>
<p>但蒂姆没有灰心，他花了2个月重新修改了建议书，加入了对超文本开发步骤与应用前景的阐述。</p>
<p>（注：超文本是用超链接的方法，将各种不同空间的文字信息组织在一起的网状文本）</p>
<p>在当时，超文本并不算一种新鲜技术，它出现于80年代中后期，起初只被人们当做是一种新型的文本而已，没有人能想到把它应用到计算机网络上去。</p>
<p>但蒂姆却天才般的想到了这一点：</p>
<p>将不同的文本信息组合在一起，通过不同的超链接，实现信息间的互相跳转，这样就可以像一张巨大的蜘蛛网一样，将全世界的网站囊括进来。</p>
<p>当他把修改过后的方案在此递交上去时，终于获得了委员会的通过，蒂姆也因此获得了一笔研究经费。</p>
<p>他用这笔经费购买了一台NEXT计算机，并率领助手开发试验系统。</p>
<p>1989年仲夏之夜，世界上第一个Web服务器和第一个Web客户机诞生。</p>
<p>虽然这个Web服务器简陋得只能说是CERN的电话号码簿，并只是允许用户进入主机以查询每个研究人员的电话号码，但它实实在在是一个所见即所得的超文本浏览/编辑器。</p>
<p>同年12月份，蒂姆将他的发明正式定名为World Wide Web，即我们熟悉的WWW。</p>
<p>蒂姆·伯纳斯-李在 1990 年下半年在一台 NeXT 电脑上开始开发 WorldWideWeb，它也只能在 NeXT 上运行。WorldWideWeb 第一个版本出现的时间是 1990 年 12 月 25 日。它不仅是一个网页浏览器，也是一个 WYSIWYG 网页编辑器。</p>
<p><img src="/44.png" alt=""></p>
<p>伯纳斯·李（Berners-Lee）在1990年下半年期间，为欧洲核研究机构CERN工作时，在NeXT计算机上撰写了被称为WorldWideWeb的文章。经过两个月的开发后，第一个成功的构建在1990年12月25日完成。该浏览器的发布新闻组在1991年8月。</p>
<p><img src="/4.jpg" alt=""></p>
<p>Berners-Lee为他的新应用程序提出了不同的名称：“The Mine of InformATIo”和“The InformATIon Mesh”是提案。最终选择了WorldWideWeb，但后来改名为Nexus，以避免World Wide Web和Web浏览器之间的混淆。</p>
<p>该团队创建了所谓的“被动浏览器”，它们没有进行编辑的能力，因为很难将此功能从NeXT系统移植到其他操作系统。无法移植到X Window系统（X），因为团队中没有人有使用X的经验。</p>
<p>Berners-Lee和Groff随后将WorldWideWeb的许多组件改编为C编程语言版本，从而创建了libwww API。出现了许多早期的浏览器，特别是ViolaWWW。从普及程度来看，它们都使Mosaic黯然失色，到1993年，Mosaic取代了WorldWideWeb程序。那些参与创建的人已经转移到其他任务，例如为进一步发展万维网定义标准和准则（例如HTML，各种通信协议）。</p>
<p>1993年4月30日，CERN理事会将WorldWideWeb的源代码发布到公共领域。各种状态的网络上仍然可以使用该软件的多个版本。 Berners-Lee最初考虑根据GNU通用公共许可证发布它，但在听到谣言说如果涉及任何许可问题，公司可能会反对该概念，他最终选择将其发布到公共领域。</p>
<h2 id="w3c官网" tabindex="-1"><a class="header-anchor" href="#w3c官网" aria-hidden="true">#</a> w3c官网</h2>
<p>万维网联盟创建于1994年，是Web技术领域最具权威和影响力的国际中立性技术标准机构。W3C已发布了200多项影响深远的Web技术标准及实施指南，如广为业界采用的超文本标记语言HTML（标准通用标记语言下的一个应用）、可扩展标记语言XML（标准通用标记语言下的一个子集）以及帮助残障人士有效获得Web信息的无障碍指南（WCAG）等，有效促进了Web技术的互相兼容，对互联网技术的发展和应用起到了基础性和根本性的支撑作用。</p>
<p><a href="https://www.w3.org/" target="_blank" rel="noopener noreferrer">W3c官网<ExternalLinkIcon/></a></p>
<p><img src="/45.png" alt="">
<img src="/46.png" alt="">
<img src="/47.png" alt=""></p>
</div></template>
